Revit 2024 API
BuiltInFailures.CutFailures.CannotCutInstanceOutGenError Property
 Can't cut instance(s) of [Symbol] out of its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCutInstanceOutGenError { get; }
Visual Basic
Public Shared ReadOnly Property CannotCutInstanceOutGenError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCutInstanceOutGenError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CutFailures Class
Autodesk.Revit.DB Namespace